![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20INSERT%20-%20UPDATE%20-%20DELETE/images/IDSNlogo.png)

# Hands-on Lab : COUNT, DISTINCT, LIMIT

**Estimated time needed:** 35 minutes

In this lab, you will learn a few useful expressions that are used with SELECT statements. First, you will learn COUNT, which is an aggregate function that retrieves the number of rows that matches the query criteria. Next, you will learn DISTINCT, which is used to remove duplicate values from a specified result set and only return the unique values. Lastly, you will learn LIMIT, which is used for restricting the number of rows retrieved from the table.

## Software Used in this Lab

In this lab, you will use [Datasette](https://github.com/simonw/datasette?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01), an open source multi-tool for exploring and publishing data.

## Database Used in this Lab

The database used in this lab comes from the following dataset source: [Film Locations in San Francisco](https://data.sfgov.org/Culture-and-Recreation/Film-Locations-in-San-Francisco/yitu-d5am?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01) under a [PDDL: Public Domain Dedication and License](https://opendatacommons.org/licenses/pddl/1-0/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01).

## Objectives

After completing this lab, you will be able to:

- Retrieve the number of rows that match a query criteria
- Remove duplicate values from a result set and return the unique values
- Restrict the number of rows retrieved from a table

In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect('data/database.db')
cur = con.cursor()

# Exploring the Database

Let us first explore the **SanFranciscoFilmLocations** database using the **Datasette** tool:

1. If the first statement listed below is not already in the Datasette textbox on the right, then copy the code below by clicking on the little copy button on the bottom right of the codeblock below and then paste it into the textbox of the Datasette tool using either **Ctrl+V** or right-click in the text box and choose **Paste**.
```sql
SELECT * FROM FilmLocations;
```
![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/ExploringDB.1.png)

2. Click **Submit Query**.

3. Now you can scroll down the table and explore all the columns and rows of the **FilmLocations** table to get an overall idea of the table contents.
![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/ExploringDB.2.png)

4. These are the column attribute descriptions from the **FilmLocations** table:
```
FilmLocations(
    Title:              titles of the films, 
    ReleaseYear:        time of public release of the films, 
    Locations:          locations of San Francisco where the films were shot, 
    FunFacts:           funny facts about the filming locations, 
    ProductionCompany:  companies who produced the films, 
    Distributor:        companies who distributed the films, 
    Director:           people who directed the films, 
    Writer:             people who wrote the films, 
    Actor1:             person 1 who acted in the films, 
    Actor2:             person 2 who acted in the films, 
    Actor3:             person 3 who acted in the films
)
```

In [5]:
query = '''
            SELECT *
            FROM FilmLocations
        '''
df = pd.read_sql_query(query, con)
df.head()

,Title,Release Year,Locations,Fun Facts,Production Company,Distributor,Director,Writer,Actor 1,Actor 2,Actor 3
0,A Jitney Elopement,1915,20th and Folsom Streets,None,The Essanay Film Manufacturing Company,General Film Company,Charles Chaplin,Charles Chaplin,Charles Chaplin,Edna Purviance,None
1,A Jitney Elopement,1915,Golden Gate Park,"During San Francisco's Gold Rush era, the Park...",The Essanay Film Manufacturing Company,General Film Company,Charles Chaplin,Charles Chaplin,Charles Chaplin,Edna Purviance,None
2,Greed,1924,Cliff House (1090 Point Lobos Avenue),"In 1887, the Cliff House was severely damaged ...",Metro-Goldwyn-Mayer (MGM),Metro-Goldwyn-Mayer (MGM),Eric von Stroheim,Eric von Stroheim,Zasu Pitts,Gibson Gowland,Jean Hersholt
3,Greed,1924,Bush and Sutter Streets,None,Metro-Goldwyn-Mayer (MGM),Metro-Goldwyn-Mayer (MGM),Eric von Stroheim,Eric von Stroheim,Zasu Pitts,Gibson Gowland,Jean Hersholt
4,Greed,1924,Hayes Street at Laguna,None,Metro-Goldwyn-Mayer (MGM),Metro-Goldwyn-Mayer (MGM),Eric von Stroheim,Eric von Stroheim,Zasu Pitts,Gibson Gowland,Jean Hersholt

# Exercise 1: COUNT

In this exercise, you will first go through some examples of using COUNT in queries and then solve some exercise problems by using it.

## Task A: Example exercises on COUNT

Let us go through some examples of COUNT related queries:

1. In this example, suppose we want to count the number of records or rows of the "FilmLocations" table.

    1. Problem:

        *Retrieve the number of rows from the "FilmLocations" table.*

    2. Solution:
    ```sql
    SELECT COUNT(*) FROM FilmLocations;
    ```

    3. Copy the solution code above by clicking on the little copy button on the bottom right of the codeblock below and paste it to the textbox of the Datasette tool. Then click **Submit query**.

    4. Your output resultset should match like below:
    ![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/1.A.1.4.png)

In [16]:
query = '''
            SELECT COUNT(*)
            FROM FilmLocations
        '''
df = pd.read_sql_query(query, con)
df

   COUNT(*)
0      1976

2. In this example, now we want to count the number of locations of the films. But we also want to restrict the output resultset in such a way that we only retrieve the number of locations of the films written by a certain writer.

    1. Problem:

        *Retrieve the number of locations of the films which are written by James Cameron.*

    2. Solution:
    ```sql
    SELECT COUNT(Locations) FROM FilmLocations WHERE Writer="James Cameron";
    ```

    3. Copy the solution code above by clicking on the little copy button on the bottom right of the codeblock below and paste it to the textbox of the Datasette tool. Then click **Submit query**.

    4. Your output resultset should match like below:
    ![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/1.A.2.4.png)

In [7]:
query = '''
            SELECT COUNT(Locations)
            FROM FilmLocations
            WHERE Writer == 'James Cameron'
        '''
df = pd.read_sql_query(query, con)
df

   COUNT(Locations)
0                24

## Task B: Practice exercises on COUNT

Now, let us practice creating and running some COUNT related queries.

1. Problem:

    *Retrieve the number of locations of the films which are directed by Woody Allen.*

<details>
	<summary>Click here for Hint</summary>

Follow example 2 of the COUNT exercise. Use the WHERE clause comparison operator = which means **"Equal to"**.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
SELECT COUNT(Locations) FROM FilmLocations WHERE Director="Woody Allen";
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/1.B.1.O.png)

</details>

In [10]:
query = '''
            SELECT COUNT(Locations)
            FROM FilmLocations
            WHERE Director == 'Woody Allen'
        '''
df = pd.read_sql_query(query, con)
df

   COUNT(Locations)
0                31

2. Problem:

    *Retrieve the number of films shot at Russian Hill.*

<details>
	<summary>Click here for Hint</summary>

Follow example 2 of the COUNT exercise. Use the WHERE clause comparison operator = which means **"Equal to"**.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
SELECT Count(Title) FROM FilmLocations WHERE Locations="Russian Hill";
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/1.B.2.O.png)

</details>

In [11]:
query = '''
            SELECT COUNT(Title)
            FROM FilmLocations
            WHERE Locations == 'Russian Hill'
        '''
df = pd.read_sql_query(query, con)
df

   COUNT(Title)
0             1

3. Problem:

    *Retrieve the number of rows having a release year older than 1950 from the "FilmLocations" table.*

<details>
	<summary>Click here for Hint</summary>

Follow example 1 of the COUNT exercise. Use the WHERE clause comparison operator < which means **"Less than"**.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
SELECT Count(*) FROM FilmLocations WHERE ReleaseYear<1950;
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/1.B.3.O.png)

</details>

In [14]:
query = '''
            SELECT COUNT(*)
            FROM FilmLocations
            WHERE [Release Year] > 1950
        '''
df = pd.read_sql_query(query, con)
df

   COUNT(*)
0      1929

# Exercise 2: DISTINCT

In this exercise, you will first go through some examples of using DISTINCT in queries, and then solve some exercise problems by using it.

## Task A: Example exercises of DISTINCT

Let us go through some examples of DISTINCT related queries:

1. In this example, we want to retrieve the title of all films in the table in such a way that duplicates will be discarded in the output resultset.

    1. Problem:

        *Retrieve the name of all films without any repeated titles.*

    2. Solution:
    ```sql
    SELECT DISTINCT Title FROM FilmLocations;
    ```

    3. Copy the solution code above by clicking on the little copy button on the bottom right of the codeblock below and paste it to the textbox of the Datasette tool. Then click **Submit query**.

    4. Your output resultset should match like below:
    ![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/2.A.1.4.png)

In [18]:
query = '''
            SELECT DISTINCT(Title)
            FROM FilmLocations
        '''
df = pd.read_sql_query(query, con)
df.head()

                Title
0  A Jitney Elopement
1               Greed
2     The Jazz Singer
3       Barbary Coast
4  After the Thin Man

2. In this example, we want to retrieve the count of release years of the films produced by a specific company in such a way that duplicate release years of those films will be discarded in the count.

    1. Problem:

        *Retrieve the number of release years of the films distinctly, produced by Warner Bros. Pictures.*

    2. Solution:
    ```sql
    SELECT COUNT(DISTINCT ReleaseYear) FROM FilmLocations WHERE ProductionCompany="Warner Bros. Pictures";
    ```

    3. Copy the solution code above by clicking on the little copy button on the bottom right of the codeblock below and paste it to the textbox of the Datasette tool. Then click **Submit query**.

    4. Your output resultset should match like below:
    ![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/2.A.2.4.png)

In [20]:
query = '''
            SELECT COUNT(DISTINCT([Release Year]))
            FROM FilmLocations
            WHERE [Production Company] == 'Warner Bros. Pictures'
        '''
df = pd.read_sql_query(query, con)
df

   COUNT(DISTINCT([Release Year]))
0                               14

## Task B: Practice exercises on DISTINCT

Now, let us practice creating and running some DISTINCT related queries.

1. Problem:

    *Retrieve the name of all unique films released in the 21st century and onwards, along with their release years.*

<details>
	<summary>Click here for Hint</summary>

Follow example 1 of DISTINCT. Use WHERE clause comparsion operator >= which means **"Greater than or equal to"**.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
SELECT DISTINCT Title, ReleaseYear FROM FilmLocations WHERE ReleaseYear>=2001;
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/2.B.1.O.png)

</details>

In [24]:
query = '''
            SELECT DISTINCT(Title), [Release Year]
            FROM FilmLocations
            WHERE [Release Year] >= 2001
        '''
df = pd.read_sql_query(query, con)
df.head()

                        Title  Release Year
0         By Hook or By Crook          2001
1              Dr. Dolittle 2          2001
2                Haiku Tunnel          2001
3  Mission (aka City of Bars)          2001
4             Never Die Twice          2001

2. Problem:

    *Retrieve the names of all the directors and their distinct films shot at City Hall.*

<details>
	<summary>Click here for Hint</summary>

Follow example 1 of DISTINCT. Use WHERE clause comparsion operator = which means **"Equal to"**.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
SELECT DISTINCT Title, Director FROM FilmLocations WHERE Locations="City Hall";
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/2.B.2.O.png)

</details>

In [31]:
query = '''
            SELECT DISTINCT(Title), Director
            FROM FilmLocations
            WHERE Locations == 'City Hall'
        '''
df = pd.read_sql_query(query, con)
df.head()

                            Title        Director
0                   San Francisco   W.S. Van Dyke
1                    Magnum Force        Ted Post
2                    The Enforcer     James Fargo
3                       Foul Play   Colin Higgins
4  Invasion of the Body Snatchers  Philip Kaufman

3. Problem:

    *Retrieve the number of distributors distinctly who distributed films acted by Clint Eastwood as 1st actor.*

<details>
	<summary>Click here for Hint</summary>

Follow example 2 of DISTINCT. Use WHERE clause comparsion operator = which means **"Equal to"**.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
SELECT COUNT(DISTINCT Distributor) FROM FilmLocations WHERE Actor1="Clint Eastwood";
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/2.B.3.O.png)

</details>

In [34]:
query = '''
            SELECT COUNT(DISTINCT(Distributor))
            FROM FilmLocations
            WHERE [Actor 1] == 'Clint Eastwood'
        '''
df = pd.read_sql_query(query, con)
df

   COUNT(DISTINCT(Distributor))
0                             3

# Exercise 3: LIMIT

In this exercise, you will first go through some examples of using LIMIT in queries and then solve some exercise by using it.

## Task A: Example exercises of LIMIT

Let us go through some examples of LIMIT related queries:

1. In this example, let us retrieve a specific number of rows from the top of the table in such a way that rows other than those are not in the output resultset.

    1. Problem:

        *Retrieve the first 25 rows from the "FilmLocations" table.*

    2. Solution:
    ```sql
    SELECT * FROM FilmLocations LIMIT 25;
    ```

    3. Copy the solution code above by clicking on the little copy button on the bottom right of the codeblock below and paste it to the textbox of the Datasette tool. Then click **Submit query**.

    4. Your output resultset should match like below:
    ![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/3.A.1.4.png)

In [37]:
query = '''
            SELECT *
            FROM FilmLocations
            LIMIT 25
        '''
df = pd.read_sql_query(query, con)
df.head()

,Title,Release Year,Locations,Fun Facts,Production Company,Distributor,Director,Writer,Actor 1,Actor 2,Actor 3
0,A Jitney Elopement,1915,20th and Folsom Streets,None,The Essanay Film Manufacturing Company,General Film Company,Charles Chaplin,Charles Chaplin,Charles Chaplin,Edna Purviance,None
1,A Jitney Elopement,1915,Golden Gate Park,"During San Francisco's Gold Rush era, the Park...",The Essanay Film Manufacturing Company,General Film Company,Charles Chaplin,Charles Chaplin,Charles Chaplin,Edna Purviance,None
2,Greed,1924,Cliff House (1090 Point Lobos Avenue),"In 1887, the Cliff House was severely damaged ...",Metro-Goldwyn-Mayer (MGM),Metro-Goldwyn-Mayer (MGM),Eric von Stroheim,Eric von Stroheim,Zasu Pitts,Gibson Gowland,Jean Hersholt
3,Greed,1924,Bush and Sutter Streets,None,Metro-Goldwyn-Mayer (MGM),Metro-Goldwyn-Mayer (MGM),Eric von Stroheim,Eric von Stroheim,Zasu Pitts,Gibson Gowland,Jean Hersholt
4,Greed,1924,Hayes Street at Laguna,None,Metro-Goldwyn-Mayer (MGM),Metro-Goldwyn-Mayer (MGM),Eric von Stroheim,Eric von Stroheim,Zasu Pitts,Gibson Gowland,Jean Hersholt

2. In this example, let us take the first example to a more advanced level. Now we want to retrieve a specific number of rows from the table, but thid time, not from the top of the table. This time we want to retrieve a specific number of rows starting from a specific row in the table.

    1. Problem:

        *Retrieve the first 15 rows from the "FilmLocations" table starting from row 11.*

    2. Solution:
    ```sql
    SELECT * FROM FilmLocations LIMIT 15 OFFSET 10;
    ```

    3. Copy the solution code above by clicking on the little copy button on the bottom right of the codeblock below and paste it to the textbox of the Datasette tool. Then click **Submit query**.

    4. Your output resultset should match like below:
    ![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/3.A.2.4.png)

In [38]:
query = '''
            SELECT *
            FROM FilmLocations
            LIMIT 15 OFFSET 10
        '''
df = pd.read_sql_query(query, con)
df.head()

,Title,Release Year,Locations,Fun Facts,Production Company,Distributor,Director,Writer,Actor 1,Actor 2,Actor 3
0,Alexander's Ragtime Band,1938,Cliff House (1090 Point Lobos Avenue),"In 1887, the Cliff House was severely damaged ...",Twentieth Century Fox Film Corporation,Twentieth Century Fox Film Corporation,Henry King,Kathryn Scola,Tyrone Power,Alice Faye,Don Ameche
1,Alexander's Ragtime Band,1938,San Francisco Bay,None,Twentieth Century Fox Film Corporation,Twentieth Century Fox Film Corporation,Henry King,Kathryn Scola,Tyrone Power,Alice Faye,Don Ameche
2,Alexander's Ragtime Band,1938,"Fairmont Hotel (950 Mason Street, Nob Hill)",In 1945 the Fairmont hosted the United Nations...,Twentieth Century Fox Film Corporation,Twentieth Century Fox Film Corporation,Henry King,Kathryn Scola,Tyrone Power,Alice Faye,Don Ameche
3,Shadow of the Thin Man,1941,Bay Bridge,"Before opening in 1936, the bridge was blessed...",Metro-Goldwyn Mayer,Metro-Goldwyn Mayer,W.S. Van Dyke,Harry Kurnitz,William Powell,Myrna Loy,Barry Nelson
4,The Maltese Falcon,1941,Golden Gate Bridge,"With 23 miles of ladders and 300,000 rivets in...",Warner Bros. Pictures,Warner Bros. Pictures,John Huston,John Huston,Humphrey Bogart,Mary Astor,Gladys George

## Task B: Practice exercises on LIMIT

Now, let us practice creating and running some LIMIT related queries.

1. Problem:

    *Retrieve the name of first 50 films distinctly.*

<details>
	<summary>Click here for Hint</summary>

Follow example 1 of LIMIT. Use DISTINCT.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
SELECT DISTINCT Title FROM FilmLocations LIMIT 50;
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/3.B.1.O.png)

</details>

In [39]:
query = '''
            SELECT DISTINCT(Title)
            FROM FilmLocations
            LIMIT 50
        '''
df = pd.read_sql_query(query, con)
df.head()

                Title
0  A Jitney Elopement
1               Greed
2     The Jazz Singer
3       Barbary Coast
4  After the Thin Man

2. Problem:

    *Retrieve first 10 film names distinctly released in 2015.*

<details>
	<summary>Click here for Hint</summary>

Follow example 1 of LIMIT. Use DISTINCT. Use WHERE clause comparsion operator = which means **"Equal to"**.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
SELECT DISTINCT Title FROM FilmLocations WHERE ReleaseYear=2015 LIMIT 10;
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/3.B.2.O.png)

</details>

In [41]:
query = '''
            SELECT DISTINCT(Title)
            FROM FilmLocations
            WHERE [Release Year] == 2015
            LIMIT 10
        '''
df = pd.read_sql_query(query, con)
df.head()

            Title
0  Age of Adaline
1       Americana
2         Ant-Man
3      Cardinal X
4    I Am Michael

3. Problem:

    *Retrieve the next 3 film names distinctly after first 5 films released in 2015.*

<details>
	<summary>Click here for Hint</summary>

Follow example 2 of the LIMIT exercise to learn how to use OFFSET. Use DISTINCT and use the WHERE clause comparison operator = which means **"Equal to"**.

</details>

<details>
	<summary>Click here for Solution</summary>

```sql
SELECT DISTINCT Title FROM FilmLocations WHERE ReleaseYear=2015 LIMIT 3 OFFSET 5;
```

</details>

<details>
	<summary>Click here for Output</summary>

![](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20COUNT%20-%20DISTINCT%20-%20LIMIT/images/3.B.3.O.png)

</details>

In [42]:
query = '''
            SELECT DISTINCT(Title)
            FROM FilmLocations
            WHERE [Release Year] == 2015
            LIMIT 3 OFFSET 5
        '''
df = pd.read_sql_query(query, con)
df.head()

                     Title
0  Looking Season 2 ep 202
1  Looking Season 2 ep 203
2  Looking Season 2 ep 204

## Congratulations! You have completed this Lab.

In [43]:
con.close()

## Author(s)

- [Sandip Saha Joy](https://www.linkedin.com/in/sandipsahajoy/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2022-01-01)

## Other Contributor(s)

-

## Changelog

| Date              | Version | Changed By          | Change Description      |
| ----------------- | ------- | ------------------- | ----------------------- |
| 2022-07-27        | 1.2     | Lakshmi Holla       | Updated html tag        |
| 2020-11-23        | 1.1     | Steve Ryan          | ID Review               |
| 2020-11-24        | 1.0     | Sandip Saha Joy     | Initial version created |

## <h3 align="center">  IBM Corporation 2020. All rights reserved. <h3/>